[
  {
    "info": "As of June 28, 2024, the aggregate market value of shares held by non-affiliates of the registrant (based upon the closing sale prices of such shares on the Nasdaq Global Select Market on June 28, 2024) was approximately $2.0 trillion. As of January 28, 2025, there were 5,833 million shares of Alphabet’s Class A stock outstanding, 860 million shares of Alphabet’s Class B stock outstanding, and 5,497 million shares of the Alphabet’s Class C stock outstanding.",
    "data": {},
    "chunk_id": 8
  },
  {
    "info": "We are continually innovating and building new products and features to help our users, partners, customers, and communities and have invested more than $150 billion in research and development in the last five years in support of these efforts.",
    "data": {},
    "chunk_id": 9
  },
  {
    "info": "We generated more than 75% of total revenues from online advertising in 2024.",
    "data": {},
    "chunk_id": 10
  },
  {
    "info": "Innovations in our products and services could also result in changes to user behavior and affect our revenue trends. These endeavors involve significant risks and uncertainties, including diversion of resources and management attention from current operations, different monetization models, and the use of alternative investment, governance, or compensation structures that may fail to adequately align incentives across the company or otherwise accomplish their objectives. There can be no assurance we will be able to provide devices that compete effectively. It is hard to predict the challenges we may encounter in adapting our products and services and developing competitive new products and services. We may also experience downward pressure on our operating margins from increasing regulations, increasing competition, and increasing costs. Our international operations expose us to additional risks that could harm our business, reputation, financial condition, and operating results. Because we conduct business in currencies other than U.S. dollars but report our financial results in U.S. dollars, we have faced, and will continue to face, exposure to fluctuations in foreign currency exchange rates. We are exposed to fluctuations in the fair values of our investments and, in some instances, our financial statements incorporate inherently subjective valuation methodologies. Some of our data centers are located in areas with a high risk of major earthquakes or other natural disasters. The occurrence of a natural disaster or pandemic, closure of a facility, or other unanticipated problems affecting our data centers could result in lengthy interruptions in our service. Interruption to, interference with, or failure of our complex information technology and communications systems could hurt our ability to effectively provide our products and services. The availability of our products and services and fulfillment of our customer contracts depend on the continuing operation of our information technology and communications systems. Our international revenues accounted for approximately 51% of our consolidated revenues in 2024. Hedging programs are also inherently risky and could expose us to additional risks that could harm our financial condition and operating results. Malicious software such as viruses, software bugs, theft, misuse, defects, vulnerabilities in our products and services, as well as cyber attacks, phishing schemes, and other types of security breaches expose us to a risk of loss or improper use and disclosure of such information, which could result in litigation and other potential liabilities, including regulatory fines and penalties, as well as reputational harm. Data privacy and security concerns relating to our technology and our practices could harm our reputation, cause us to incur significant liability, and deter current and potential users or customers from using our products and services. Some uses of AI will present ethical issues and may have broad effects on society. We may not be able to identify or resolve all AI-related issues, deficiencies, and/or failures before they arise. Unintended consequences, uses, or customization of our AI tools and systems may negatively affect human rights, privacy, employment, or other social concerns, which may result in claims, lawsuits, brand or reputational harm, and increased regulatory scrutiny, any of which could harm our business, financial condition, and operating results. Concerns about, including the adequacy of, our practices with regard to the collection, use, governance, disclosure, or security of personal data or other data-privacy-related matters, even if unfounded, could harm our business, reputation, financial condition, and operating results. Our policies and practices may change over time as expectations and regulations regarding privacy and data change. Our systems are vulnerable to damage, interference, or interruption from modifications or upgrades, terrorist attacks, state-sponsored attacks, natural disasters or pandemics, geopolitical tensions or armed conflicts, export controls and sanctions, the effects of climate change (such as sea level rise, drought, flooding, heat waves, wildfires and resultant air quality effects and power shutdowns associated with wildfire prevention, and increased storm severity), power and transmission availability challenges, utility outages, telecommunications failures, computer viruses, software bugs, cyber attacks, supply-chain attacks, computer denial of service attacks, phishing schemes, or other attempts to harm or access our systems. The availability of our products and services and fulfillment of our customer contracts depend on the continuing operation of our information technology and communications systems. Our international revenues accounted for approximately 51% of our consolidated revenues in 2024. Hedging programs are also inherently risky and could expose us to additional risks that could harm our financial condition and operating results. Some of our data centers are located in areas with a high risk of major earthquakes or other natural disasters.",
    "data": {},
    "chunk_id": 11
  },
  {
    "info": "The U.S. DOJ, various U.S. states, and other plaintiffs have filed, and may continue to file in the future, several antitrust lawsuits about various aspects of our business, including our advertising technologies and practices, the operation and distribution of Google Search, and the operation and distribution of the Android operating system and Play Store. For example, the DOJ and a number of state Attorneys General filed a lawsuit alleging that Google violated antitrust laws relating to Search and Search advertising, and in August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such antitrust laws. The Court is holding a separate proceeding to determine remedies, which could include alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes. We are appealing the verdict, but if we are unsuccessful, we could face significant expenses to implement the remedies, and such costs and alterations could harm our business, reputation, financial condition, and operating results. Also, in December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated antitrust laws relating to Google Play's business. The presiding judge issued a remedies decision in October 2024 that ordered a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. In December 2020, several State Attorneys General, led by the Texas Attorney General, filed an antitrust lawsuit in the U.S. District Court for the Eastern District of Texas alleging that Google violated antitrust and other laws relating to its advertising technology. This case is set for trial in March 2025, and we could face significant civil penalties. In January 2023, the DOJ and several Attorneys General sued in the Eastern District of Virginia alleging similar antitrust violations relating to Google’s advertising technology. Trial in the DOJ matter concluded in September 2024 with a decision expected in early 2025. If we are unsuccessful, we could face an order on remedies that could harm our business, reputation, financial condition, and operating results. In addition to these regulatory proceedings, private individual and collective actions that overlap with claims pursued by regulators are pending in the U.S. and in several other jurisdictions. Adverse results in these or similar future lawsuits may include awards of monetary damages and remedies that could harm our business, reputation, financial condition, and operating results. We face the risk of cyber attacks by nation-states and state-sponsored actors. Our ongoing investments in safety, security, and content review will likely continue to identify abuse of our platforms and misuse of user data. In addition to our efforts to prevent and mitigate cyber attacks, we are making significant investments in safety, security, and review efforts to combat misuse of our services and unauthorized access to user data by third parties, including investigation and review of platform applications that could access the information of users of our services.",
    "data": {},
    "chunk_id": 12
  },
  {
    "info": "For example, the DOJ and a number of state Attorneys General filed a lawsuit alleging that Google violated antitrust laws relating to Search and Search advertising, and in August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such antitrust laws. The Court is holding a separate proceeding to determine remedies, which could include alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes.",
    "data": {},
    "chunk_id": 13
  },
  {
    "info": "Our acquisitions and other strategic arrangements could also result in dilutive issuances of our equity securities, the incurrence of debt, contingent liabilities, or amortization expenses, or impairment of goodwill and/or purchased long-lived assets, and restructuring charges, any of which could harm our financial condition and operating results.",
    "data": {},
    "chunk_id": 14
  },
  {
    "info": "•Revenues were $350.0 billion, an increase of 14% year over year, primarily driven by an increase in Google Services revenues of $32.4 billion, or 12%, and an increase in Google Cloud revenues of $10.1 billion, or 31%.",
    "data": {
      "revenue_2023": 307394000000,
      "revenue_2024": 350018000000,
      "cost_of_revenues_2023": 133332000000,
      "cost_of_revenues_2024": 146306000000,
      "operating_expenses_2023": 89769000000,
      "operating_expenses_2024": 91322000000,
      "operating_income_2023": 84293000000,
      "operating_income_2024": 112390000000,
      "net_income_2023": 73795000000,
      "net_income_2024": 100118000000,
      "diluted_eps_2023": 5.8,
      "diluted_eps_2024": 8.04,
      "operating_margin_2023": 27,
      "operating_margin_2024": 32,
      "dividends_2024": 7400000000,
      "repurchases_2024": 62000000000,
      "operating_cash_flow_2024": 125300000000,
      "capital_expenditures_2024": 52500000000
    },
    "chunk_id": 15
  },
  {
    "info": "Total constant currency revenues, which exclude the effect of hedging, increased 15% year over year. Cost of revenues was $146.3 billion, an increase of 10% year over year, primarily driven by increases in content acquisition costs, TAC, and depreciation expense. Operating expenses were $91.3 billion, an increase of 2% year over year, primarily driven by increases in depreciation expense, employee compensation expenses, and third-party services fees. These increases were partially offset by reductions in charges related to legal and other matters and charges related to our office space optimization efforts. The overall increase in employee compensation expenses was partially offset by a reduction in employee severance and related charges.",
    "data": {
      "revenue_2023": 307394000000,
      "revenue_2024": 350018000000,
      "operating_cash_flow_2024": 125300000000,
      "capital_expenditures_2024": 52500000000
    },
    "chunk_id": 16
  },
  {
    "info": "R&D expenses increased $3.9 billion from 2023 to 2024, primarily driven by increases in employee compensation expenses of $1.5 billion, depreciation expense of $1.4 billion, and third-party services fees of $698 million, partially offset by a reduction in charges related to our office space optimization efforts of $640 million.",
    "data": {
      "operating_income_2023": 84293,
      "operating_income_2024": 112390,
      "google_services_operating_income_2023": 95858,
      "google_services_operating_income_2024": 121263,
      "google_cloud_operating_income_2023": 1716,
      "google_cloud_operating_income_2024": 6112,
      "other_bets_operating_loss_2023": -4095,
      "other_bets_operating_loss_2024": -4444,
      "alphabet_level_activities_operating_loss_2023": -9186,
      "alphabet_level_activities_operating_loss_2024": -10541,
      "income_before_tax_2023": 85717,
      "income_before_tax_2024": 119815,
      "provision_for_income_taxes_2023": 11922,
      "provision_for_income_taxes_2024": 19697,
      "cash_and_short_term_marketable_securities_2024": 95700000000,
      "net_cash_provided_by_operating_activities_2023": 101746,
      "net_cash_provided_by_operating_activities_2024": 125299,
      "net_cash_used_in_investing_activities_2023": 27063,
      "net_cash_used_in_investing_activities_2024": 45536,
      "net_cash_used_in_financing_activities_2023": 72093,
      "net_cash_used_in_financing_activities_2024": 79733
    },
    "chunk_id": 17
  }
]