[
  {
    "info": "As of June 28, 2024, the aggregate market value of shares held by non-affiliates of the registrant (based upon the closing sale prices of such shares on the Nasdaq Global Select Market on June 28, 2024) was approximately $2.0 trillion. As of January 28, 2025, there were 5,833 million shares of Alphabet’s Class A stock outstanding, 860 million shares of Alphabet’s Class B stock outstanding, and 5,497 million shares of the Alphabet’s Class C stock outstanding.",
    "data": {},
    "chunk_id": 8
  },
  {
    "info": "We are continually innovating and building new products and features to help our users, partners, customers, and communities and have invested more than $150 billion in research and development in the last five years in support of these efforts.",
    "data": {},
    "chunk_id": 9
  },
  {
    "info": "We generated more than 75% of total revenues from online advertising in 2024.",
    "data": {},
    "chunk_id": 10
  },
  {
    "info": "Innovations in our products and services could also result in changes to user behavior and affect our revenue trends. These endeavors involve significant risks and uncertainties, including diversion of resources and management attention from current operations, different monetization models, and the use of alternative investment, governance, or compensation structures that may fail to adequately align incentives across the company or otherwise accomplish their objectives. There can be no assurance we will be able to provide devices that compete effectively. It is hard to predict the challenges we may encounter in adapting our products and services and developing competitive new products and services. We may also experience downward pressure on our operating margins from increasing regulations, increasing competition, and increasing costs. Our international operations expose us to additional risks that could harm our business, reputation, financial condition, and operating results. Because we conduct business in currencies other than U.S. dollars but report our financial results in U.S. dollars, we have faced, and will continue to face, exposure to fluctuations in foreign currency exchange rates. We are exposed to fluctuations in the fair values of our investments and, in some instances, our financial statements incorporate inherently subjective valuation methodologies. Some of our data centers are located in areas with a high risk of major earthquakes or other natural disasters. The occurrence of a natural disaster or pandemic, closure of a facility, or other unanticipated problems affecting our data centers could result in lengthy interruptions in our service. Interruption to, interference with, or failure of our complex information technology and communications systems could hurt our ability to effectively provide our products and services. The availability of our products and services and fulfillment of our customer contracts depend on the continuing operation of our information technology and communications systems. Our international revenues accounted for approximately 51% of our consolidated revenues in 2024. Hedging programs are also inherently risky and could expose us to additional risks that could harm our financial condition and operating results. Malicious software such as viruses, software bugs, theft, misuse, defects, vulnerabilities in our products and services, as well as cyber attacks, phishing schemes, and other types of security breaches expose us to a risk of loss or improper use and disclosure of such information, which could result in litigation and other potential liabilities, including regulatory fines and penalties, as well as reputational harm. Data privacy and security concerns relating to our technology and our practices could harm our reputation, cause us to incur significant liability, and deter current and potential users or customers from using our products and services. Some uses of AI will present ethical issues and may have broad effects on society. We may not be able to identify or resolve all AI-related issues, deficiencies, and/or failures before they arise. Unintended consequences, uses, or customization of our AI tools and systems may negatively affect human rights, privacy, employment, or other social concerns, which may result in claims, lawsuits, brand or reputational harm, and increased regulatory scrutiny, any of which could harm our business, financial condition, and operating results. Concerns about, including the adequacy of, our practices with regard to the collection, use, governance, disclosure, or security of personal data or other data-privacy-related matters, even if unfounded, could harm our business, reputation, financial condition, and operating results. Our policies and practices may change over time as expectations and regulations regarding privacy and data change. Our systems are vulnerable to damage, interference, or interruption from modifications or upgrades, terrorist attacks, state-sponsored attacks, natural disasters or pandemics, geopolitical tensions or armed conflicts, export controls and sanctions, the effects of climate change (such as sea level rise, drought, flooding, heat waves, wildfires and resultant air quality effects and power shutdowns associated with wildfire prevention, and increased storm severity), power and transmission availability challenges, utility outages, telecommunications failures, computer viruses, software bugs, cyber attacks, supply-chain attacks, computer denial of service attacks, phishing schemes, or other attempts to harm or access our systems. The availability of our products and services and fulfillment of our customer contracts depend on the continuing operation of our information technology and communications systems. Our international revenues accounted for approximately 51% of our consolidated revenues in 2024. Hedging programs are also inherently risky and could expose us to additional risks that could harm our financial condition and operating results. Some of our data centers are located in areas with a high risk of major earthquakes or other natural disasters.",
    "data": {},
    "chunk_id": 11
  },
  {
    "info": "The U.S. DOJ, various U.S. states, and other plaintiffs have filed, and may continue to file in the future, several antitrust lawsuits about various aspects of our business, including our advertising technologies and practices, the operation and distribution of Google Search, and the operation and distribution of the Android operating system and Play Store. For example, the DOJ and a number of state Attorneys General filed a lawsuit alleging that Google violated antitrust laws relating to Search and Search advertising, and in August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such antitrust laws. The Court is holding a separate proceeding to determine remedies, which could include alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes. We are appealing the verdict, but if we are unsuccessful, we could face significant expenses to implement the remedies, and such costs and alterations could harm our business, reputation, financial condition, and operating results. Also, in December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated antitrust laws relating to Google Play's business. The presiding judge issued a remedies decision in October 2024 that ordered a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. In December 2020, several State Attorneys General, led by the Texas Attorney General, filed an antitrust lawsuit in the U.S. District Court for the Eastern District of Texas alleging that Google violated antitrust and other laws relating to its advertising technology. This case is set for trial in March 2025, and we could face significant civil penalties. In January 2023, the DOJ and several Attorneys General sued in the Eastern District of Virginia alleging similar antitrust violations relating to Google’s advertising technology. Trial in the DOJ matter concluded in September 2024 with a decision expected in early 2025. If we are unsuccessful, we could face an order on remedies that could harm our business, reputation, financial condition, and operating results. In addition to these regulatory proceedings, private individual and collective actions that overlap with claims pursued by regulators are pending in the U.S. and in several other jurisdictions. Adverse results in these or similar future lawsuits may include awards of monetary damages and remedies that could harm our business, reputation, financial condition, and operating results. We face the risk of cyber attacks by nation-states and state-sponsored actors. Our ongoing investments in safety, security, and content review will likely continue to identify abuse of our platforms and misuse of user data. In addition to our efforts to prevent and mitigate cyber attacks, we are making significant investments in safety, security, and review efforts to combat misuse of our services and unauthorized access to user data by third parties, including investigation and review of platform applications that could access the information of users of our services.",
    "data": {},
    "chunk_id": 12
  },
  {
    "info": "For example, the DOJ and a number of state Attorneys General filed a lawsuit alleging that Google violated antitrust laws relating to Search and Search advertising, and in August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such antitrust laws. The Court is holding a separate proceeding to determine remedies, which could include alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes.",
    "data": {},
    "chunk_id": 13
  },
  {
    "info": "Our acquisitions and other strategic arrangements could also result in dilutive issuances of our equity securities, the incurrence of debt, contingent liabilities, or amortization expenses, or impairment of goodwill and/or purchased long-lived assets, and restructuring charges, any of which could harm our financial condition and operating results.",
    "data": {},
    "chunk_id": 14
  },
  {
    "info": "•Revenues were $350.0 billion, an increase of 14% year over year, primarily driven by an increase in Google Services revenues of $32.4 billion, or 12%, and an increase in Google Cloud revenues of $10.1 billion, or 31%.",
    "data": {
      "revenue_2023": 307394000000,
      "revenue_2024": 350018000000,
      "cost_of_revenues_2023": 133332000000,
      "cost_of_revenues_2024": 146306000000,
      "operating_expenses_2023": 89769000000,
      "operating_expenses_2024": 91322000000,
      "operating_income_2023": 84293000000,
      "operating_income_2024": 112390000000,
      "net_income_2023": 73795000000,
      "net_income_2024": 100118000000,
      "diluted_eps_2023": 5.8,
      "diluted_eps_2024": 8.04,
      "operating_margin_2023": 27,
      "operating_margin_2024": 32,
      "dividends_2024": 7400000000,
      "repurchases_2024": 62000000000,
      "operating_cash_flow_2024": 125300000000,
      "capital_expenditures_2024": 52500000000
    },
    "chunk_id": 15
  },
  {
    "info": "Total constant currency revenues, which exclude the effect of hedging, increased 15% year over year. Cost of revenues was $146.3 billion, an increase of 10% year over year, primarily driven by increases in content acquisition costs, TAC, and depreciation expense. Operating expenses were $91.3 billion, an increase of 2% year over year, primarily driven by increases in depreciation expense, employee compensation expenses, and third-party services fees. These increases were partially offset by reductions in charges related to legal and other matters and charges related to our office space optimization efforts. The overall increase in employee compensation expenses was partially offset by a reduction in employee severance and related charges.",
    "data": {
      "revenue_2023": 307394000000,
      "revenue_2024": 350018000000,
      "operating_cash_flow_2024": 125300000000,
      "capital_expenditures_2024": 52500000000
    },
    "chunk_id": 16
  },
  {
    "info": "R&D expenses increased $3.9 billion from 2023 to 2024, primarily driven by increases in employee compensation expenses of $1.5 billion, depreciation expense of $1.4 billion, and third-party services fees of $698 million, partially offset by a reduction in charges related to our office space optimization efforts of $640 million.",
    "data": {
      "operating_income_2023": 84293,
      "operating_income_2024": 112390,
      "google_services_operating_income_2023": 95858,
      "google_services_operating_income_2024": 121263,
      "google_cloud_operating_income_2023": 1716,
      "google_cloud_operating_income_2024": 6112,
      "other_bets_operating_loss_2023": -4095,
      "other_bets_operating_loss_2024": -4444,
      "alphabet_level_activities_operating_loss_2023": -9186,
      "alphabet_level_activities_operating_loss_2024": -10541,
      "income_before_tax_2023": 85717,
      "income_before_tax_2024": 119815,
      "provision_for_income_taxes_2023": 11922,
      "provision_for_income_taxes_2024": 19697,
      "cash_and_short_term_marketable_securities_2024": 95700000000,
      "net_cash_provided_by_operating_activities_2023": 101746,
      "net_cash_provided_by_operating_activities_2024": 125299,
      "net_cash_used_in_investing_activities_2023": 27063,
      "net_cash_used_in_investing_activities_2024": 45536,
      "net_cash_used_in_financing_activities_2023": 72093,
      "net_cash_used_in_financing_activities_2024": 79733
    },
    "chunk_id": 17
  },
  {
    "info": "During 2024, we repurchased and subsequently retired 379 million shares for $62.0 billion.",
    "data": {
      "capital_expenditures_2023": 32300000000,
      "capital_expenditures_2024": 52500000000,
      "depreciation_2023": 11900000000,
      "depreciation_2024": 15300000000,
      "operating_lease_expenses_2023": 4500000000,
      "operating_lease_expenses_2024": 4700000000,
      "finance_lease_costs_2023": 504000000,
      "finance_lease_costs_2024": 444000000,
      "operating_lease_payments_total_2024": 17000000000,
      "operating_lease_payments_short_term_2024": 3200000000,
      "finance_lease_payments_total_2024": 1900000000,
      "finance_lease_payments_short_term_2024": 257000000,
      "leases_not_yet_commenced_future_short_term_2024": 773000000,
      "leases_not_yet_commenced_future_long_term_2024": 6500000000,
      "short_term_commercial_paper_outstanding_2024": 2300000000,
      "senior_unsecured_notes_outstanding_2024": 11900000000,
      "revolving_credit_facilities_total_2024": 10000000000,
      "revolving_credit_facilities_expiring_2025": 4000000000,
      "revolving_credit_facilities_expiring_2028": 6000000000,
      "credit_facilities_borrowed_2024": 0,
      "income_taxes_payable_2024": 2700000000,
      "long_term_taxes_payable_2024": 8800000000,
      "purchase_commitments_and_obligations_2024": 55400000000,
      "short_term_purchase_commitments_and_obligations_2024": 32500000000,
      "ec_fine_cash_payment_2017_shopping_2024": 3000000000,
      "short_term_commercial_paper_outstanding_2024_duplicate": 2300000000,
      "total_purchase_commitments_and_other_contractual_obligations_2024": 55400000000,
      "operating_lease_future_payments_total_2024": 17000000000,
      "operating_lease_future_payments_short_term_2024": 3200000000,
      "finance_lease_future_payments_total_2024": 1900000000,
      "finance_lease_future_payments_short_term_2024": 257000000
    },
    "chunk_id": 18
  },
  {
    "info": "If the U.S. dollar weakened by 10%, the amount recorded in cumulative translation adjustment (CTA) within AOCI related to our net investment hedges before tax effect would have been approximately $946 million and $660 million lower as of December 31, 2023 and 2024, respectively. The change in value recorded in CTA would be expected to offset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries. We record marketable equity securities not accounted for under the equity method at fair value based on readily determinable market values, of which publicly traded stocks and mutual funds are subject to market price volatility, and represent $6.0 billion and $5.1 billion of our investments as of December 31, 2023 and 2024, respectively. The carrying values of our equity method investments, which totaled approximately $1.7 billion and $2.0 billion as of December 31, 2023 and 2024, respectively, generally do not fluctuate based on market price changes. As of December 31, 2023 and 2024, the carrying value of our non-marketable equity securities, which were accounted for under the measurement alternative, was $28.8 billion and $35.5 billion, respectively. A hypothetical adverse price change of 10% on our December 31, 2024 balance would decrease the fair value of marketable equity securities by $508 million.",
    "data": {
      "non_marketable_equity_securities_2023": 28800000000,
      "non_marketable_equity_securities_2024": 35500000000,
      "equity_method_investments_2023": 1700000000,
      "equity_method_investments_2024": 2000000000,
      "marketable_equity_securities_2023": 6000000000,
      "marketable_equity_securities_2024": 5100000000
    },
    "chunk_id": 19
  },
  {
    "info": "Net income | | | $ | 59,972 |  |  | | | $ | 73,795 |  |  | | | $ | 100,118 |  |",
    "data": {
      "revenue_2022": 282836,
      "revenue_2023": 307394,
      "revenue_2024": 350018,
      "net_income_2022": 59972,
      "net_income_2023": 73795,
      "net_income_2024": 100118,
      "eps_basic_2022": 4.59,
      "eps_basic_2023": 5.84,
      "eps_basic_2024": 8.13,
      "eps_diluted_2022": 4.56,
      "eps_diluted_2023": 5.8,
      "eps_diluted_2024": 8.04,
      "total_assets_2023": 402392,
      "total_assets_2024": 450256,
      "total_liabilities_2023": 119013,
      "total_liabilities_2024": 125172,
      "total_stockholders_equity_2023": 283379,
      "total_stockholders_equity_2024": 325084,
      "cash_and_cash_equivalents_2023": 24048,
      "cash_and_cash_equivalents_2024": 23466,
      "marketable_securities_2023": 86868,
      "marketable_securities_2024": 72191,
      "total_current_assets_2023": 171530,
      "total_current_assets_2024": 163711,
      "non_marketable_securities_2023": 31008,
      "non_marketable_securities_2024": 37982,
      "deferred_income_taxes_2023": 12169,
      "deferred_income_taxes_2024": 17180,
      "property_and_equipment_net_2023": 134345,
      "property_and_equipment_net_2024": 171036,
      "operating_lease_assets_2023": 14091,
      "operating_lease_assets_2024": 13588,
      "goodwill_2023": 29198,
      "goodwill_2024": 31885,
      "other_non_current_assets_2023": 10051,
      "other_non_current_assets_2024": 14874,
      "long_term_debt_2023": 11870,
      "long_term_debt_2024": 10883,
      "income_taxes_payable_non_current_2023": 8474,
      "income_taxes_payable_non_current_2024": 8782,
      "operating_lease_liabilities_2023": 12460,
      "operating_lease_liabilities_2024": 11691,
      "other_long_term_liabilities_2023": 4395,
      "other_long_term_liabilities_2024": 4694,
      "current_accounts_payable_2023": 7493,
      "current_accounts_payable_2024": 7987,
      "accrued_compensation_and_benefits_2023": 15140,
      "accrued_compensation_and_benefits_2024": 15069,
      "accrued_expenses_and_other_current_liabilities_2023": 46168,
      "accrued_expenses_and_other_current_liabilities_2024": 51228,
      "accrued_revenue_share_2023": 8876,
      "accrued_revenue_share_2024": 9802,
      "deferred_revenue_2023": 4137,
      "deferred_revenue_2024": 5036,
      "accumulated_other_comprehensive_income_loss_2023": -4402,
      "accumulated_other_comprehensive_income_loss_2024": -4800
    },
    "chunk_id": 20
  },
  {
    "info": "In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google.",
    "data": {
      "net_income_2022": 59972,
      "net_income_2023": 73795,
      "net_income_2024": 100118,
      "net_cash_from_operating_activities_2022": 91495,
      "net_cash_from_operating_activities_2023": 101746,
      "net_cash_from_operating_activities_2024": 125299,
      "net_cash_used_in_investing_activities_2022": -20298,
      "net_cash_used_in_investing_activities_2023": -27063,
      "net_cash_used_in_investing_activities_2024": -45536,
      "net_cash_used_in_financing_activities_2022": -69757,
      "net_cash_used_in_financing_activities_2023": -72093,
      "net_cash_used_in_financing_activities_2024": -79733,
      "cash_and_cash_equivalents_end_of_period_2022": 21879,
      "cash_and_cash_equivalents_end_of_period_2023": 24048,
      "cash_and_cash_equivalents_end_of_period_2024": 23466,
      "stockholders_equity_2021": 251635,
      "stockholders_equity_2022": 256144,
      "stockholders_equity_2023": 283379,
      "stockholders_equity_2024": 325084
    },
    "chunk_id": 21
  },
  {
    "info": "For the years ended December 31, 2022, 2023, and 2024, advertising and promotional expenses totaled approximately 9.2 billion, 8.7 billion, and 8.7 billion, respectively.",
    "data": {},
    "chunk_id": 22
  },
  {
    "info": "As of December 31, 2024, we had $93.2 billion of remaining performance obligations (“revenue backlog”), primarily related to Google Cloud. Revenue backlog includes related deferred revenue currently recorded as well as amounts that will be invoiced in future periods, and excludes contracts with an original expected term of one year or less and cancellable contracts. No individual customer or groups of affiliated customers represented more than 10% of our revenues in 2022, 2023, or 2024. Total deferred revenue as of December 31, 2023 was $5.0 billion, of which $3.9 billion was recognized as revenues for the year ended December 31, 2024. Total deferred revenue as of December 31, 2024 was $6.0 billion.",
    "data": {
      "revenue_2022": 282836000000,
      "revenue_2023": 307394000000,
      "revenue_2024": 350018000000,
      "deferred_revenue_2023": 5000000000,
      "deferred_revenue_2024": 6000000000,
      "deferred_revenue_recognized_in_2024": 3900000000,
      "revenue_backlog_2024": 93200000000
    },
    "chunk_id": 23
  },
  {
    "info": "(1)Represents gross unrealized gains and losses for debt securities recorded to AOCI. (2)The long-term portion of marketable equity securities (subject to long-term lock-up restrictions) of $1.4 billion as of December 31, 2023 is included within other non-current assets.",
    "data": {},
    "chunk_id": 24
  },
  {
    "info": "Non-marketable equity securities cumulative net gain (loss) is comprised of 18.1 billion and 22.7 billion of gains and 6.9 billion and 8.4 billion of losses (including impairments) as of December 31, 2023 and 2024, respectively.",
    "data": {
      "marketable_initial_cost_2023": 5418000000,
      "marketable_initial_cost_2024": 4767000000,
      "non_marketable_initial_cost_2023": 17616000000,
      "non_marketable_initial_cost_2024": 21240000000,
      "total_initial_cost_2023": 23034000000,
      "total_initial_cost_2024": 26007000000,
      "marketable_cumulative_net_gain_2023": 555000000,
      "non_marketable_cumulative_net_gain_2023": 11150000000,
      "total_cumulative_net_gain_2023": 11705000000,
      "marketable_cumulative_net_gain_2024": 312000000,
      "non_marketable_cumulative_net_gain_2024": 14291000000,
      "total_cumulative_net_gain_2024": 14603000000,
      "marketable_carrying_value_2023": 5973000000,
      "non_marketable_carrying_value_2023": 28766000000,
      "total_carrying_value_2023": 34739000000,
      "marketable_carrying_value_2024": 5079000000,
      "non_marketable_carrying_value_2024": 35531000000,
      "total_carrying_value_2024": 40610000000,
      "convertible_notes_2023": 921000000,
      "convertible_notes_2024": 2900000000,
      "equity_method_carrying_value_2023": 1700000000,
      "equity_method_carrying_value_2024": 2000000000
    },
    "chunk_id": 25
  },
  {
    "info": "The gross amounts of derivative instruments subject to master netting arrangements with various counterparties, and cash and non-cash collateral received and pledged under such agreements were as follows (in millions):",
    "data": {
      "revenue_2022": 282836000000,
      "revenue_2023": 307394000000,
      "revenue_2024": 350018000000,
      "operating_lease_assets_2023": 14091000000,
      "operating_lease_assets_2024": 13588000000,
      "accrued_expenses_and_other_liabilities_operating_leases_2023": 2791000000,
      "accrued_expenses_and_other_liabilities_operating_leases_2024": 2887000000,
      "operating_lease_liabilities_2023": 12460000000,
      "operating_lease_liabilities_2024": 11691000000,
      "total_operating_lease_liabilities_2023": 15251000000,
      "total_operating_lease_liabilities_2024": 14578000000,
      "finance_lease_cost_property_and_equipment_cost_2023": 4403000000,
      "finance_lease_cost_property_and_equipment_cost_2024": 4622000000,
      "accumulated_depreciation_2023": -1652000000,
      "accumulated_depreciation_2024": -2037000000,
      "property_and_equipment_net_2023": 2751000000,
      "property_and_equipment_net_2024": 2585000000,
      "accrued_expenses_and_other_liabilities_finance_leases_2023": 283000000,
      "accrued_expenses_and_other_liabilities_finance_leases_2024": 235000000,
      "other_long_term_liabilities_2023": 1383000000,
      "other_long_term_liabilities_2024": 1442000000,
      "total_finance_lease_liabilities_2023": 1666000000,
      "total_finance_lease_liabilities_2024": 1677000000
    },
    "chunk_id": 26
  },
  {
    "info": "As of December 31, 2024, we have entered into leases that have not yet commenced with short-term and long-term future lease payments of $773 million and $6.5 billion, respectively, that are not yet recorded on our Consolidated Balance Sheets. These leases will commence between 2025 and 2028 with non-cancelable lease terms between one and 25 years.",
    "data": {
      "operating_cash_flows_used_for_operating_leases_2022": 2722,
      "operating_cash_flows_used_for_operating_leases_2023": 3173,
      "operating_cash_flows_used_for_operating_leases_2024": 3425,
      "operating_cash_flows_used_for_finance_leases_2022": 34,
      "operating_cash_flows_used_for_finance_leases_2023": 35,
      "operating_cash_flows_used_for_finance_leases_2024": 31,
      "financing_cash_flows_used_for_finance_leases_2022": 586,
      "financing_cash_flows_used_for_finance_leases_2023": 705,
      "financing_cash_flows_used_for_finance_leases_2024": 405,
      "assets_obtained_in_exchange_for_lease_liabilities_operating_leases_2022": 4383,
      "assets_obtained_in_exchange_for_lease_liabilities_operating_leases_2023": 2877,
      "assets_obtained_in_exchange_for_lease_liabilities_operating_leases_2024": 2510,
      "assets_obtained_in_exchange_for_lease_liabilities_finance_leases_2022": 577,
      "assets_obtained_in_exchange_for_lease_liabilities_finance_leases_2023": 564,
      "assets_obtained_in_exchange_for_lease_liabilities_finance_leases_2024": 313,
      "total_future_lease_payments_operating_leases_as_of_dec_31_2024": 17038,
      "total_future_lease_payments_finance_leases_as_of_dec_31_2024": 1888,
      "imputed_interest_operating_leases": -2460,
      "imputed_interest_finance_leases": -211,
      "as_of_dec_31_2023_total_lease_liability_balance": 14578,
      "as_of_dec_31_2024_total_lease_liability_balance": 1677,
      "leases_not_commenced_as_of_dec_31_2024_short_term": 773,
      "leases_not_commenced_as_of_dec_31_2024_long_term": 6500,
      "waymo_funding_2024": 5600000000,
      "assets_of_VIEs_can_be_used_to_settle_obligations_2023": 4900000000,
      "assets_of_VIEs_can_be_used_to_settle_obligations_2024": 8700000000,
      "total_noncontrolling_interests_2023": 3400000000,
      "total_noncontrolling_interests_2024": 4200000000,
      "noncontrolling_interest_redeemable_nih_2023": 1100000000,
      "noncontrolling_interest_redeemable_nih_2024": 1100000000,
      "notes_outstanding_fair_value_total_2023": 10300000000,
      "notes_outstanding_fair_value_total_2024": 9000000000,
      "credit_facilities_total_2024": 10000000000,
      "credit_facilities_outstanding_dec_31_2023": 0,
      "credit_facilities_outstanding_dec_31_2024": 0,
      "credit_facilities_expires_2025": 4000000000,
      "credit_facilities_expires_2028": 6000000000,
      "commercial_paper_outstanding_dec_31_2024": 2300000000,
      "commercial_paper_outstanding_dec_31_2023": 0,
      "total_face_value_of_long_term_debt_2023": 13000000000,
      "total_face_value_of_long_term_debt_2024": 12000000000,
      "unamortized_discount_and_debt_issuance_costs_2023": -130000000,
      "unamortized_discount_and_debt_issuance_costs_2024": -118000000,
      "total_long_term_debt_2023": 11870000000,
      "total_long_term_debt_2024": 10883000000,
      "current_portion_of_long_term_notes_2023": -1000000000,
      "current_portion_of_long_term_notes_2024": -999000000,
      "long_term_debt_principal_2025": 1000000000,
      "long_term_debt_principal_2026": 2000000000,
      "long_term_debt_principal_2027": 1000000000,
      "long_term_debt_principal_2028": 0,
      "long_term_debt_principal_2029": 0,
      "long_term_debt_principal_Thereafter": 8000000000,
      "long_term_debt_principal_total": 12000000000,
      "revolving_credit_facilities_total_2024": 10000000000,
      "revolving_credit_facilities_outstanding_dec_31_2023": 0,
      "revolving_credit_facilities_outstanding_dec_31_2024": 0,
      "commercial_paper_outstanding_dec_31_2024_additional": 2300000000,
      "property_and_equipment_net_2023": 134345000000,
      "property_and_equipment_net_2024": 171036000000,
      "property_and_equipment_in_service_2023": 166667000000,
      "property_and_equipment_in_service_2024": 199829000000,
      "accumulated_depreciation_2023": -67458000000,
      "accumulated_depreciation_2024": -79390000000,
      "assets_not_yet_in_service_2023": 35136000000,
      "assets_not_yet_in_service_2024": 50597000000,
      "european_commission_fines_2023": 9525000000,
      "european_commission_fines_2024": 6322000000,
      "accrued_purchases_of_property_and_equipment_2023": 4679000000,
      "accrued_purchases_of_property_and_equipment_2024": 7104000000,
      "accrued_customer_liabilities_2023": 4140000000,
      "accrued_customer_liabilities_2024": 4304000000,
      "current_operating_lease_liabilities_2023": 2791000000,
      "current_operating_lease_liabilities_2024": 2887000000,
      "income_taxes_payable_net_2023": 2748000000,
      "income_taxes_payable_net_2024": 2905000000,
      "other_accrued_expenses_and_current_liabilities_2023": 22285000000,
      "other_accrued_expenses_and_current_liabilities_2024": 27706000000,
      "accrued_expenses_and_other_current_liabilities_2023": 46168000000,
      "accrued_expenses_and_other_current_liabilities_2024": 51228000000
    },
    "chunk_id": 27
  },
  {
    "info": "In accordance with the accounting requirements under Accounting Standards Codification Topic 805, for the year ended December 31, 2024, we recorded $2.7 billion of goodwill and $413 million of intangible assets resulting from a transaction with character.ai (\"Character\"). In August 2024, we entered into a license agreement with Character pursuant to which we obtained a non-exclusive license to its then current large language model technology. We paid Character $2.7 billion in cash and canceled our convertible instruments. Commitments: We have content licensing agreements with future fixed or minimum guaranteed commitments of $8.8 billion as of December 31, 2024, of which the majority is paid quarterly through the first quarter of 2030. The amounts related to the EC fines, including any under appeal, are included in accrued expenses and other current liabilities on our Consolidated Balance Sheets. Amounts include the effects of foreign exchange and interest. In September 2024, the European Court of Justice rejected our appeal and upheld the €2.4 billion fine. In the third quarter of 2024, we made a cash payment of $3.0 billion for the fine. Android: In July 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European antitrust laws, imposed a €4.3 billion fine, and directed the termination of the conduct at issue. We appealed the EC decision and implemented changes to certain of our Android distribution practices. In September 2022, the General Court affirmed the EC decision but reduced the fine from €4.3 billion to €4.1 billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. AdSense for Search: In March 2019, the EC announced its decision that certain provisions in Google's agreements with AdSense for Search partners infringed European antitrust laws, imposed a fine of €1.5 billion, and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. In 2019, we recognized a charge of $1.7 billion for the fine and appealed the EC decision. In September 2024, the General Court overturned the EC decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision with the European Court of Justice. Note 8. Business Combinations character.ai: In accordance with the accounting requirements under Accounting Standards Codification Topic 805, for the year ended December 31, 2024, we recorded $2.7 billion of goodwill and $413 million of intangible assets resulting from a transaction with character.ai (\"Character\"). In August 2024, we entered into a license agreement with Character pursuant to which we obtained a non-exclusive license to its then current large language model technology. We paid Character $2.7 billion in cash and canceled our convertible instruments.",
    "data": {
      "total_assets_2022": 28960,
      "total_assets_2023": 29198,
      "total_assets_2024": 31885,
      "cash_paid_ec_fine_2024": 3000000000,
      "cash_paid_character_2024": 2700000000
    },
    "chunk_id": 28
  },
  {
    "info": "Shopping: In June 2017, the EC announced its decision that certain actions taken by Google relating to its display and ranking of shopping search results and ads infringed European antitrust laws and imposed a €2.4 billion fine. We appealed the EC decision and implemented product changes to bring shopping ads into compliance with the EC's decision. In September 2024, the European Court of Justice rejected our appeal and upheld the €2.4 billion fine. In the third quarter of 2024, we made a cash payment of $3.0 billion for the fine. Android: In July 2018, the EC announced its decision that certain provisions in Google’s Android-related distribution agreements infringed European antitrust laws, imposed a €4.3 billion fine, and directed the termination of the conduct at issue. We appealed the EC decision and implemented changes to certain of our Android distribution practices. In September 2022, the General Court affirmed the EC decision but reduced the fine from €4.3 billion to €4.1 billion. We subsequently appealed the General Court's affirmation of the EC decision with the European Court of Justice, which remains pending. In 2018, we recognized a charge of $5.1 billion for the fine, which we reduced by $217 million in 2022. AdSense for Search: In March 2019, the EC announced its decision that certain provisions in Google's agreements with AdSense for Search partners infringed European antitrust laws, imposed a fine of €1.5 billion, and directed actions related to AdSense for Search partners' agreements, which we implemented prior to the decision. In 2019, we recognized a charge of $1.7 billion for the fine and appealed the EC decision. In September 2024, the General Court overturned the EC decision and annulled the €1.5 billion fine. The EC has appealed the General Court's decision with the European Court of Justice. Search: In October 2020, the DOJ and a number of state Attorneys General filed a lawsuit in the U.S. District Court for the District of Columbia alleging that Google violated U.S. antitrust laws relating to Search and Search advertising. In August 2024, the U.S. District Court for the District of Columbia ruled that Google violated such U.S. antitrust laws. A separate proceeding is being held to determine remedies, the range of which vary widely. The DOJ has proposed a high level remedy framework, which includes alterations to our products and services and our business models and operations, including structural remedies, and/or our distribution arrangements, among other changes, some of which could have a material adverse effect on our business. We have filed our own remedies proposal ahead of a hearing on remedies in April 2025. We expect a decision likely in the second half of 2025, after which we intend to appeal. Further, in June 2022, the Australian Competition and Consumer Commission and in October 2023, the Japanese Fair Trade Commission each opened an investigation into Search distribution practices. Given the nature of these matters, we cannot estimate a possible loss. Advertising Technology: In December 2020, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Eastern District of Texas alleging that Google violated U.S. antitrust laws as well as state deceptive trade laws relating to its advertising technology, and a trial is scheduled for March 2025. Additionally, in January 2023, the DOJ, along with a number of state Attorneys General, filed a lawsuit in the U.S. District Court for the Eastern District of Virginia alleging that Google violated U.S. antitrust laws relating to its advertising technology, and a number of additional state Attorneys General subsequently joined the lawsuit. The trial ended in September 2024, and we expect a decision in early 2025. Further, in June 2023, the EC issued a Statement of Objections informing Google of its preliminary view that Google violated European antitrust laws relating to its advertising technology, to which we responded. Given the nature of these matters, we cannot estimate a possible loss. Google Play: In July 2021, a number of state Attorneys General filed a lawsuit in the U.S. District Court for the Northern District of California alleging that Google’s operation of Android and Google Play violated U.S. antitrust laws and state antitrust and consumer protection laws. In September 2023, we reached a settlement in principle with 50 state Attorneys General and three territories and recognized a charge. Final approval of the settlement remains pending before the court. In May 2024, we funded the settlement amount to an escrow agent. In December 2023, a California jury delivered a verdict in Epic Games v. Google finding that Google violated U.S. antitrust laws related to Google Play's business. Epic did not seek monetary damages. The presiding judge issued a remedies decision in October 2024, ordering a variety of alterations to our business models and operations and contractual agreements for Android and Google Play. We are appealing the verdict and the trial court judge temporarily paused the implementation of the remedies while the Court of Appeals considers our request to pause implementation of the remedies pending the duration of the appeal. Given the nature of this matter, we cannot estimate a possible loss. European Digital Markets Act: In March 2024, the EC opened two investigations regarding Google's compliance with certain provisions of EU's Digital Markets Act relating to Google Play and Search. Given the preliminary stages of this matter, we cannot estimate a possible loss. In addition to these proceedings, private individual and collective actions that overlap with claims pursued by regulatory authorities are pending in the U.S. and in several other jurisdictions. We believe we have strong arguments against these open claims and will defend ourselves vigorously. We continue to cooperate with federal and state regulators in the U.S., the EC, and other regulators around the world. Privacy Matters We are subject to a number of privacy-related laws and regulations, and we currently are party to a number of privacy investigations and lawsuits ongoing in multiple jurisdictions. For example, there are ongoing investigations and litigation in the U.S. and the EU, including those relating to our collection and use of location information, alleged violations of state biometric statutes, the choices we offer users, and advertising practices, which could result in significant fines, judgments, and product changes. Patent and Intellectual Property Claims We have had patent, copyright, trade secret, and trademark infringement lawsuits filed against us claiming that certain of our products, services, and technologies infringe others' intellectual property rights. Adverse results in these lawsuits may include awards of substantial monetary damages, costly royalty or licensing agreements, or orders preventing us from offering certain features, functionalities, products, or services. As a result, we may have to change our business practices and develop non-infringing products or technologies, which could result in a loss of revenues for us and otherwise harm our business. In addition, the U.S. International Trade Commission (ITC) has increasingly become an important forum to litigate intellectual property disputes because an ultimate loss in an ITC action can result in a prohibition on importing infringing products into the U.S. Because the U.S. is an important market, a prohibition on importation could have an adverse effect on us, including preventing us from importing many important products into the U.S. or necessitating workarounds that may limit certain features of our products. Further, our customers and partners may discontinue the use of our products, services, and technologies, as a result of injunctions or otherwise, which could result in loss of revenues and adversely affect our business. Other We are subject to claims, lawsuits, regulatory and government inquiries and investigations, other proceedings, and consent orders involving competition, intellectual property, data privacy and security, tax and related compliance, labor and employment, commercial disputes, content generated by our users, goods and services offered by advertisers or publishers using our platforms, personal injury, consumer protection, and other matters. For example, we periodically have data incidents that we report to relevant regulators as required by law. Such claims, consent orders, lawsuits, regulatory and government investigations, and other proceedings could result in substantial fines and penalties, injunctive relief, ongoing monitoring and auditing obligations, changes to our products and services, alterations to our business models and operations, and collateral related civil litigation or other adverse consequences, all of which could harm our business, reputation, financial condition, and operating results. We have ongoing legal matters relating to Russia. For example, some matters concern civil judgments that include compounding penalties imposed upon us in connection with disputes regarding the termination of accounts, including those of sanctioned parties. We do not expect these ongoing legal matters will have a material adverse effect. Non-Income Taxes We are under audit by various domestic and foreign tax authorities with regards to non-income tax matters. The subject matter of non-income tax audits primarily arises from disputes on the tax treatment and tax rate applied to the sale of our products and services in these jurisdictions and the tax treatment of certain employee benefits. We accrue non-income taxes that may result from examinations by, or any negotiated agreements with, these tax authorities when a loss is probable and reasonably estimable. If we determine that a loss is reasonably possible and the loss or range of loss can be estimated, we disclose the reasonably possible loss. Due to the inherent complexity and uncertainty of these matters and judicial process in certain jurisdictions, the final outcome may be materially different from our expectations. See Note 14 for information regarding income tax contingencies. Note 11. Stockholders' Equity",
    "data": {
      "ec_shopping_fine_2024": 2400000000,
      "ec_shopping_cash_payment_2024_q3": 3000000000,
      "ec_android_fine_2024": 4300000000,
      "ec_android_fine_2022_reduction": 217000000,
      "ec_adsense_search_fine_2019": 1500000000,
      "ec_adsense_search_fine_2019_charge": 1700000000,
      "ec_adsense_search_fine_annulled": 1500000000,
      "dividends_classA_2024": 3500000000,
      "dividends_classB_2024": 519000000,
      "dividends_classC_2024": 3300000000,
      "repurchases_total_2022": 59300000000,
      "repurchases_total_2023": 62200000000,
      "repurchases_total_2024": 62000000000,
      "repurchases_classA_2023": 9316000000,
      "repurchases_classA_2024": 11855000000,
      "repurchases_classC_2023": 52868000000,
      "repurchases_classC_2024": 50192000000,
      "repurchases_classA_2023_shares": 78,
      "repurchases_classA_2024_shares": 73,
      "repurchases_classC_2023_shares": 450,
      "repurchases_classC_2024_shares": 306,
      "repurchase_authorized_additional_2024": 70000000000,
      "repurchase_remaining_authorization_dec31_2024": 44700000000
    },
    "chunk_id": 29
  },
  {
    "info": "The following tables set forth the computation of basic and diluted net income per share of Class A, Class B, and Class C stock (in millions, except per share amounts):",
    "data": {
      "net_income_2022_classA": 27518,
      "net_income_2022_classB": 4072,
      "net_income_2022_classC": 28382,
      "net_income_2022_consolidated": 59972,
      "basic_eps_2022_classA": 4.59,
      "basic_eps_2022_classB": 4.59,
      "basic_eps_2022_classC": 4.59,
      "basic_eps_2022_consolidated": 4.59,
      "diluted_eps_2022_classA": 4.56,
      "diluted_eps_2022_classB": 4.56,
      "diluted_eps_2022_classC": 4.56,
      "diluted_eps_2022_consolidated": 4.56,
      "net_income_2023_classA": 39438,
      "net_income_2023_classB": 5087,
      "net_income_2023_classC": 34357,
      "net_income_2023_consolidated": 73795,
      "basic_eps_2023_classA": 5.84,
      "basic_eps_2023_classB": 5.84,
      "basic_eps_2023_classC": 5.84,
      "basic_eps_2023_consolidated": 5.84,
      "diluted_eps_2023_classA": 5.8,
      "diluted_eps_2023_classB": 5.8,
      "diluted_eps_2023_classC": 5.8,
      "diluted_eps_2023_consolidated": 5.8
    },
    "chunk_id": 30
  },
  {
    "info": "For the years ended December 31, 2022, 2023, and 2024, total SBC expense was $19.5 billion, $22.1 billion, and $22.8 billion, including amounts associated with awards we expect to settle in Alphabet stock of $18.8 billion, $21.7 billion, and $22.0 billion, respectively. As of December 31, 2024, there was $34.8 billion of unrecognized compensation cost related to unvested RSUs. As of December 31, 2024, there were 633 million shares of Class C stock reserved for future issuance under the Alphabet 2021 Stock Plan. The weighted-average grant-date fair value of RSUs granted during the years ended December 31, 2022 and 2023 was $127.22 and $97.59, respectively. Total fair value of RSUs, as of their respective vesting dates, during the years ended December 31, 2022, 2023, and 2024, were $23.9 billion, $26.6 billion, and $33.3 billion, respectively. For the years ended December 31, 2022, 2023, and 2024, tax benefit realized related to awards vested or exercised during the period was $4.7 billion, $5.6 billion, and $6.8 billion, respectively.",
    "data": {
      "sbc_expense_2022": 19500000000,
      "sbc_expense_2023": 22100000000,
      "sbc_expense_2024": 22800000000,
      "sbc_stock_settle_amount_2022": 18800000000,
      "sbc_stock_settle_amount_2023": 21700000000,
      "sbc_stock_settle_amount_2024": 22000000000,
      "unrecognized_cost_rsus_2024": 34800000000,
      "shares_reserved_classC_stock_plan_2024": 633000000,
      "rsu_weighted_avg_fair_value_2022": 127.22,
      "rsu_weighted_avg_fair_value_2023": 97.59,
      "rsu_total_fair_value_2022": 23900000000,
      "rsu_total_fair_value_2023": 26600000000,
      "rsu_total_fair_value_2024": 33300000000,
      "tax_benefit_awards_2022": 4700000000,
      "tax_benefit_awards_2023": 5600000000,
      "tax_benefit_awards_2024": 6800000000
    },
    "chunk_id": 31
  },
  {
    "info": "As of December 31, 2024, our Federal and California research and development credit carryforwards for income tax purposes were approximately $700 million and $6.4 billion, respectively.",
    "data": {
      "federal_r_and_d_credit_carryforwards_2024": 700000000,
      "california_r_and_d_credit_carryforwards_2024": 6400000000,
      "federal_nol_carryforwards_2024": 8400000000,
      "state_nol_carryforwards_2024": 19400000000,
      "foreign_nol_carryforwards_2024": 2500000000,
      "investment_tax_credit_carryforwards_state_2024": 1200000000,
      "cash_paid_income_taxes_net_of_refunds_2024": 27400000000,
      "total_deferred_tax_assets_net_of_valuation_allowance_2023": 26145000000,
      "total_deferred_tax_assets_net_of_valuation_allowance_2024": 33364000000,
      "valuation_allowance_2023": 10999000000,
      "valuation_allowance_2024": 11493000000,
      "deferred_tax_liabilities_total_2023": 14461000000,
      "deferred_tax_liabilities_total_2024": 16904000000,
      "net_deferred_tax_assets_liabilities_2023": 11684000000,
      "net_deferred_tax_assets_liabilities_2024": 16460000000,
      "total_revenues_2024": 350018000000,
      "google_services_revenues_2024": 304930000000,
      "google_cloud_revenues_2024": 43229000000,
      "other_bets_revenues_2024": 1648000000,
      "hedging_gains_losses_2024": 211000000,
      "total_income_from_operations_2024": 112390000000,
      "google_services_operating_income_2024": 121263000000,
      "google_cloud_operating_income_2024": 6112000000,
      "other_bets_operating_income_2024": -4444000000,
      "alphabet_level_activities_operating_loss_2024": -10541000000,
      "total_google_services_costs_and_expenses_2024": 183667000000,
      "google_services_employee_compensation_2024": 44560000000,
      "google_services_other_costs_expenses_2024": 139107000000,
      "google_cloud_employee_compensation_2024": 20519000000,
      "google_cloud_other_costs_expenses_2024": 16598000000,
      "google_cloud_total_costs_expenses_2024": 37117000000,
      "long_lived_assets_US_2024": 138993000000,
      "long_lived_assets_international_2024": 45631000000,
      "total_long_lived_assets_2024": 184624000000,
      "long_lived_assets_US_2023": 110053000000,
      "long_lived_assets_international_2023": 38383000000,
      "total_long_lived_assets_2023": 148436000000
    },
    "chunk_id": 32
  },
  {
    "info": "In January 2025, we recognized an $8.0 billion unrealized gain on our non-marketable equity securities related to our investment in a private company. The unrealized gain reflects an increase in the fair value measurement of our investment following an observable transaction in January 2025. See Note 3 and Note 7 for further details on equity investments and OI&E.",
    "data": {},
    "chunk_id": 33
  }
]