[
  {
    "info": "The aggregate market value of the voting stock held by non-affiliates of the registrant as of July 26, 2024 was approximately $2.7 trillion (based on the closing sales price of the registrant's common stock as reported by the Nasdaq Global Select Market on July 26, 2024).",
    "data": {},
    "chunk_id": 6
  },
  {
    "info": "In fiscal year 2025, we launched the NVIDIA Blackwell architecture, a full set of data center scale infrastructure that includes GPUs, CPUs, DPUs, interconnects, switch chips and systems, and networking adapters.",
    "data": {},
    "chunk_id": 7
  },
  {
    "info": "On January 15, 2025, the USG published the “AI Diffusion” IFR in the Federal Register.",
    "data": {},
    "chunk_id": 8
  },
  {
    "info": "Failure to meet the evolving needs of our industry and markets may adversely impact our financial results.",
    "data": {},
    "chunk_id": 9
  },
  {
    "info": "generated 53% of our revenue in fiscal year 2025 from sales outside the United States.",
    "data": {},
    "chunk_id": 10
  },
  {
    "info": "We are monitoring the impact of the geopolitical conflict in and around Israel on our operations, including the health and safety of our approximately 4,700 employees in the region who primarily support the research and development, operations, and sales and marketing of our networking products. Sales to direct Customers A, B and C represented 12%, 11% and 11% of total revenue, respectively, for fiscal year 2025, all of which were primarily attributable to the Compute & Networking segment. For fiscal year 2025, an indirect customer which primarily purchases our products through system integrators and distributors, including through Customer B, is estimated to represent 10% or more of total revenue, attributable to the Compute & Networking segment.",
    "data": {},
    "chunk_id": 11
  },
  {
    "info": "After a 120-day delayed compliance period, the IFR will, unless modified, impose a worldwide licensing requirement on all products classified under Export Control Classification Numbers, or ECCNs, 3A090.a, 4A090.a, or corresponding .z ECCNs, including all related software and technology.",
    "data": {},
    "chunk_id": 12
  },
  {
    "info": "Any new restrictions that negatively impact our ability to receive supply of components, parts, or services from Taiwan and South Korea, would negatively impact our business and financial results.",
    "data": {},
    "chunk_id": 13
  },
  {
    "info": "In fiscal year 2025, we paid cash dividends to our shareholders of 834 million.",
    "data": {
      "dividends_2025": 834000000,
      "share_repurchase_cash_2025": 34000000000,
      "repurchase_authorized_remaining_2025": 38700000000,
      "repurchase_recent_cash_2025": 3700000000,
      "rsu_withholding_value_2025": 6900000000,
      "stock_issuance_value_dec6_2024": 13500000,
      "stock_issuance_value_dec29_2024": 28100000,
      "authorized_common_stock_before_split_2024": 8000000000,
      "authorized_common_stock_after_split_2024": 80000000000
    },
    "chunk_id": 14
  },
  {
    "info": "Revenue for fiscal year 2025 was 130.5 billion, up 114% from a year ago. Data Center revenue for fiscal year 2025 was up 142% from a year ago. The strong year-on-year growth was driven by demand for our Hopper architecture accelerated computing platform used for large language models, recommendation engines, and generative AI applications. We began shipping production systems of the Blackwell architecture in the fourth quarter of fiscal year 2025. Gaming revenue for fiscal year 2025 was up 9% from a year ago, driven by sales of our GeForce RTX 40 Series GPUs. Professional Visualization revenue for fiscal year 2025 was up 21% from a year ago, driven by the continued ramp of Ada RTX GPU workstations for use cases such as generative AI-powered design, simulation, and engineering. Automotive revenue for fiscal year 2025 was up 55% from a year ago, driven by sales of our self-driving platforms. Gross margin increased in fiscal year 2025 driven by a higher mix of Data Center revenue. Operating expenses for fiscal year 2025 were up 45% from a year ago, driven by higher compensation and benefits expenses due to employee growth and compensation increases, and engineering development, compute and infrastructure costs for new product introductions.",
    "data": {
      "revenue_2025": 130497000000,
      "revenue_2024": 60922000000,
      "gross_margin_2025": 75.0,
      "gross_margin_2024": 72.7,
      "operating_expenses_2025": 16405,
      "operating_expenses_2024": 11329,
      "operating_income_2025": 81453,
      "operating_income_2024": 32972,
      "net_income_2025": 72880,
      "net_income_2024": 29760,
      "net_income_per_diluted_share_2025": 2.94,
      "net_income_per_diluted_share_2024": 1.19,
      "revenue_by_segment_2025": {
        "Compute_and_Networking": 116193,
        "Graphics": 14304,
        "Total": 130497
      },
      "revenue_by_segment_2024": {
        "Compute_and_Networking": 47405,
        "Graphics": 13517,
        "Total": 60922
      },
      "operating_income_by_segment_2025": {
        "Compute_and_Networking": 82875,
        "Graphics": 5085,
        "All_Other": -6507,
        "Total": 81453
      },
      "operating_income_by_segment_2024": {
        "Compute_and_Networking": 32016,
        "Graphics": 5846,
        "All_Other": -4890,
        "Total": 32972
      }
    },
    "chunk_id": 15
  },
  {
    "info": "Gross margins increased to 75.0% in fiscal year 2025 from 72.7% in fiscal year 2024. The year over year increase was primarily driven by a higher mix of Data Center revenue. Revenue from sales to customers outside of the United States accounted for 53% and 56% of total revenue for fiscal years 2025 and 2024, respectively. Provisions for inventory and excess inventory purchase obligations totaled $3.7 billion and $2.2 billion for fiscal years 2025 and 2024, respectively. Sales of previously reserved inventory and settlements of excess inventory purchase obligations resulted in a provision release of $689 million and $540 million for fiscal years 2025 and 2024, respectively. The net effect on our gross margin was an unfavorable impact of 2.3% and 2.7% in fiscal years 2025 and 2024, respectively. The increases in research and development expenses for fiscal year 2025 were driven by a 32% increase in compensation and benefits, including stock-based compensation, reflecting employee growth and compensation increases, a 100% increase in compute and infrastructure, and a 234% increase in engineering development costs for new product introductions. The increases in sales, general and administrative expenses for fiscal year 2025 were primarily driven by compensation and benefits, including stock-based compensation, reflecting employee growth and compensation increases. Our investment policy requires the purchase of highly-rated fixed income securities, the diversification of investment types and credit exposures, and certain maturity limits on our portfolio. As of the end of fiscal year 2025, we had $8.5 billion of senior Notes outstanding. We carry the Notes at face value less unamortized discount on our Consolidated Balance Sheets. On August 26, 2024, our Board of Directors approved an additional $50 billion to our share repurchase authorization, without expiration. In fiscal year 2025, we repurchased 310 million shares of our common stock for $34.0 billion. As of January 26, 2025, we were authorized, subject to certain specifications, to repurchase up to $38.7 billion of our common stock. From January 27, 2025 through February 21, 2025, we repurchased 29 million shares for $3.7 billion pursuant to a pre-established trading plan. In fiscal year 2025, we paid cash dividends to our shareholders of $834 million. The U.S. Inflation Reduction Act of 2022 requires a 1% excise tax on certain share repurchases in excess of shares issued for employee compensation made after December 31, 2022. The excise tax is included in our share repurchase cost and was not material for fiscal years 2025 and 2024. During fiscal year 2025 and fiscal year 2024, we spent $3.4 billion and $1.1 billion on capital expenditures, respectively. We expect to increase capital expenditures in fiscal year 2026 relative to fiscal year 2025 to support the future growth of our business. Unrecognized tax benefits of $2.2 billion, which includes related interest and penalties of $251 million, were recorded in non-current income tax payable at the end of fiscal year 2025. We are unable to estimate the timing of any potential tax liability, interest payments, or penalties in individual years due to uncertainties in the underlying income tax positions and the timing of the effective settlement of such tax positions. Gains or losses from foreign currency remeasurement are included in other income or expenses. The impact of foreign currency transaction gain or loss included in determining net income was not significant for fiscal years 2025 and 2024. Sales and arrangements with third-party manufacturers provide for pricing and payment in United States dollars, and, therefore, are not subject to exchange rate fluctuations. Increases in the value of the United States’ dollar relative to other currencies would make our products more expensive, which could negatively impact our ability to compete. Conversely, decreases in the value of the United States’ dollar relative to other currencies could result in our suppliers raising their manufacturing costs. If the U.S. dollar strengthened by 10% as of January 26, 2025 and January 28, 2024, the amount recorded in accumulated other comprehensive income (loss) related to our foreign exchange contracts before tax effect would have been $136 million and $116 million lower, respectively. If an adverse 10% foreign exchange rate change was applied to our balance sheet hedging contracts, it would have resulted in an adverse impact on income before taxes of $129 million and $60 million as of January 26, 2025 and January 28, 2024, respectively.",
    "data": {
      "gross_margin_2025": 75.0,
      "gross_margin_2024": 72.7,
      "revenue_outside_us_2025_pct": 53,
      "revenue_outside_us_2024_pct": 56,
      "cash_and_cash_equivalents_2025": 8589,
      "marketable_securities_2025": 34621,
      "cash_and_cash_equivalents_and_marketable_securities_2025": 43210,
      "cash_and_cash_equivalents_2024": 7280,
      "marketable_securities_2024": 18704,
      "cash_and_cash_equivalents_and_marketable_securities_2024": 25984,
      "net_cash_provided_by_operating_activities_2025": 64089,
      "net_cash_used_in_investing_activities_2025": -20421,
      "net_cash_used_in_financing_activities_2025": -42359,
      "senior_notes_outstanding_2025": 8500000000,
      "commercial_paper_outstanding_2025": 0,
      "commercial_paper_program_cap_2025": 575000000,
      "capital_expenditures_2025": 3400000000,
      "capital_expenditures_2024": 1100000000,
      "unrecognized_tax_benefits_2025": 2200000000,
      "dividends_paid_2025": 834000000,
      "due_in_one_year_2025": 0,
      "due_in_one_to_five_years_2025": 2250,
      "due_in_five_to_ten_years_2025": 2750,
      "due_in_greater_than_ten_years_2025": 3500,
      "unamortized_debt_discount_and_issuance_costs_2025": -37,
      "net_long_term_carrying_amount_debt_2025": 8463
    },
    "chunk_id": 16
  },
  {
    "info": "As of the end of fiscal year 2025, we had 8.5 billion of senior Notes outstanding. We carry the Notes at face value less unamortized discount on our Consolidated Balance Sheets. As the Notes bear interest at a fixed rate, we have no financial statement risk associated with changes in interest rates.",
    "data": {
      "notes_outstanding_2025": 8500000000,
      "aoci_impact_10pct_2025_lower": 136000000,
      "aoci_impact_10pct_2024_lower": 116000000,
      "income_before_taxes_adverse_10pct_2025": 129000000,
      "income_before_taxes_adverse_10pct_2024": 60000000
    },
    "chunk_id": 17
  },
  {
    "info": "As of January 26, 2025, the Company’s consolidated inventories balance was $10.1 billion and the Company’s consolidated outstanding inventory purchase and long-term supply and capacity obligations balance was $30.8 billion, of which a significant portion relates to inventory purchase obligations.",
    "data": {
      "revenue_2025": 130497000000,
      "revenue_2024": 60922000000,
      "revenue_2023": 26974000000,
      "net_income_2025": 72880000000,
      "net_income_2024": 29760000000,
      "net_income_2023": 4368000000,
      "operating_income_2025": 81453000000,
      "operating_income_2024": 32972000000,
      "operating_income_2023": 4224000000,
      "eps_basic_2025": 2.97,
      "eps_basic_2024": 1.21,
      "eps_basic_2023": 0.18,
      "eps_diluted_2025": 2.94,
      "eps_diluted_2024": 1.19,
      "eps_diluted_2023": 0.17,
      "total_assets_2025": 111601000000,
      "total_assets_2024": 65728000000,
      "total_liabilities_2025": 32274000000,
      "total_liabilities_2024": 22750000000,
      "total_shareholders_equity_2025": 79327000000,
      "total_shareholders_equity_2024": 42978000000,
      "cash_and_cash_equivalents_2025": 8589000000,
      "cash_and_cash_equivalents_2024": 7280000000,
      "marketable_securities_2025": 34621000000,
      "marketable_securities_2024": 18704000000,
      "accounts_receivable_net_2025": 23065000000,
      "accounts_receivable_net_2024": 9999000000,
      "inventories_2025": 10080000000,
      "inventories_2024": 5282000000,
      "prepaid_expenses_and_other_current_assets_2025": 3771000000,
      "prepaid_expenses_and_other_current_assets_2024": 3080000000,
      "long_term_debt_2025": 8463000000,
      "long_term_debt_2024": 8459000000,
      "short_term_debt_2025": 0,
      "short_term_debt_2024": 1250000000,
      "common_stock_2025": 24,
      "common_stock_2024": 25,
      "additional_paid_in_capital_2025": 11237000000,
      "additional_paid_in_capital_2024": 13109000000,
      "retained_earnings_2025": 68038000000,
      "retained_earnings_2024": 29817000000
    },
    "chunk_id": 18
  },
  {
    "info": "In June 2024, we executed a ten-for-one stock split of our common stock. All share, equity award, and per share amounts and related shareholders' equity balances presented herein have been retroactively adjusted to reflect the Stock Split. We operate on a 52- or 53-week year, ending on the last Sunday in January. Fiscal years 2025, 2024 and 2023 were all 52-week years.",
    "data": {
      "net_income_2025": 72880000000,
      "net_income_2024": 29760000000,
      "net_income_2023": 4368000000,
      "cash_flows_operating_activities_2025": 64089000000,
      "cash_flows_operating_activities_2024": 28090000000,
      "cash_flows_operating_activities_2023": 5641000000,
      "stock_based_compensation_expense_2025": 4737000000,
      "stock_based_compensation_expense_2024": 3549000000,
      "stock_based_compensation_expense_2023": 2709000000,
      "depreciation_and_amortization_2025": 1864000000,
      "depreciation_and_amortization_2024": 1508000000,
      "depreciation_and_amortization_2023": 1544000000,
      "deferred_income_taxes_2025": -4477000000,
      "deferred_income_taxes_2024": -2489000000,
      "deferred_income_taxes_2023": -2164000000,
      "accounts_receivable_change_2025": -13063000000,
      "accounts_receivable_change_2024": -6172000000,
      "accounts_receivable_change_2023": 822000000,
      "inventories_change_2025": -4781000000,
      "inventories_change_2024": -98000000,
      "inventories_change_2023": -2554000000,
      "prepaid_expenses_and_other_assets_change_2025": -395000000,
      "prepaid_expenses_and_other_assets_change_2024": -1522000000,
      "prepaid_expenses_and_other_assets_change_2023": -1517000000,
      "accounts_payable_change_2025": 3357000000,
      "accounts_payable_change_2024": 1531000000,
      "accounts_payable_change_2023": -551000000,
      "accrued_and_other_current_liabilities_change_2025": 4278000000,
      "accrued_and_other_current_liabilities_change_2024": 2025000000,
      "accrued_and_other_current_liabilities_change_2023": 1341000000,
      "other_long_term_liabilities_change_2025": 1221000000,
      "other_long_term_liabilities_change_2024": 514000000,
      "other_long_term_liabilities_change_2023": 252000000,
      "net_cash_provided_by_operating_activities_2025": 64089000000,
      "net_cash_provided_by_operating_activities_2024": 28090000000,
      "net_cash_provided_by_operating_activities_2023": 5641000000,
      "net_cash_provided_by_investing_activities_2025": -20421000000,
      "net_cash_provided_by_investing_activities_2024": -10566000000,
      "net_cash_provided_by_investing_activities_2023": 7375000000,
      "net_cash_used_in_financing_activities_2025": -42359000000,
      "net_cash_used_in_financing_activities_2024": -13633000000,
      "net_cash_used_in_financing_activities_2023": -11617000000,
      "cash_end_of_period_2025": 8589000000,
      "cash_end_of_period_2024": 7280000000,
      "cash_end_of_period_2023": 3389000000,
      "cash_paid_for_income_taxes_2025": 15118000000,
      "cash_paid_for_income_taxes_2024": 6549000000,
      "cash_paid_for_income_taxes_2023": 1404000000,
      "cash_paid_for_interest_2025": 246000000,
      "cash_paid_for_interest_2024": 252000000,
      "cash_paid_for_interest_2023": 254000000,
      "total_shareholders_equity_2025": 79327000000,
      "total_shareholders_equity_2024": 42978000000,
      "total_shareholders_equity_2023": 22101000000
    },
    "chunk_id": 19
  },
  {
    "info": "In February 2022, NVIDIA and SoftBank Group Corp, or SoftBank, announced the termination of the Share Purchase Agreement whereby NVIDIA would have acquired Arm from SoftBank. The parties agreed to terminate it due to significant regulatory challenges preventing the completion of the transaction. We recorded an acquisition termination cost of $1.4 billion in fiscal year 2023 reflecting the write-off of the prepayment provided at signing. As of January 26, 2025, we had a valuation allowance of $1.6 billion related to capital loss carryforwards, and certain state and other deferred tax assets that management determined are not likely to be realized due, in part, to jurisdictional projections of future taxable income, including capital gains. To the extent realization of the deferred tax assets becomes more-likely-than-not, we would recognize such deferred tax assets as income tax benefits during the period.",
    "data": {
      "acquisition_termination_cost_2023": 1400000000,
      "valuation_allowance_capital_loss_carryforwards_as_of_2025": 1600000000
    },
    "chunk_id": 20
  },
  {
    "info": "In February 2022, NVIDIA and SoftBank Group Corp, or SoftBank, announced the termination of the Share Purchase Agreement whereby NVIDIA would have acquired Arm from SoftBank. The parties agreed to terminate it due to significant regulatory challenges preventing the completion of the transaction. We recorded an acquisition termination cost of 1.4 billion in fiscal year 2023 reflecting the write-off of the prepayment provided at signing.",
    "data": {
      "acquisition_termination_cost_2023": 1400000000,
      "net_income_2025": 72880,
      "net_income_2024": 29760,
      "net_income_2023": 4368,
      "eps_basic_2025": 2.97,
      "eps_diluted_2025": 2.94,
      "eps_basic_2024": 1.21,
      "eps_diluted_2024": 1.19,
      "eps_basic_2023": 0.18,
      "eps_diluted_2023": 0.17,
      "unearned_stock_compensation_2025": 11600,
      "rsus_psus_outstanding_2025": 274,
      "rsus_psus_outstanding_2024": 367,
      "goodwill_2025": 5200,
      "goodwill_2024": 4400,
      "acquisition_related_intangible_assets_2025_gross": 2900,
      "acquisition_related_intangible_assets_2025_accumulated_amortization": 2264,
      "acquisition_related_intangible_assets_2025_net": 636,
      "acquisition_related_intangible_assets_2024_gross": 2642,
      "acquisition_related_intangible_assets_2024_accumulated_amortization": 1720,
      "acquisition_related_intangible_assets_2024_net": 922
    },
    "chunk_id": 21
  },
  {
    "info": "Amortization expense associated with intangible assets for fiscal years 2025, 2024, and 2023 was 593 million, 614 million, and 699 million, respectively.",
    "data": {},
    "chunk_id": 22
  },
  {
    "info": "The fair values of our financial assets and liabilities are determined using quoted market prices of identical assets or market prices of similar assets from active markets. We review fair value classification on a quarterly basis. Our non-marketable equity securities are recorded in long-term other assets on our Consolidated Balance Sheets and valued under the measurement alternative. Gains and losses on these investments, realized and unrealized, are recognized in Other income (expense), net on our Consolidated Statements of Income. Non-marketable equity securities had cumulative gross unrealized gains of $1.1 billion and $270 million, and cumulative gross unrealized losses and impairments of $105 million and $45 million on securities held as of January 26, 2025 and January 28, 2024, respectively. In the fourth quarter of fiscal year 2025, one of our private company investments completed a secondary equity transaction that resulted in an unrealized gain of $565 million.",
    "data": {},
    "chunk_id": 23
  },
  {
    "info": "(1) Deferred revenue additions includes 3.6 billion and 783 million related to customer advances for fiscal years 2025 and 2024, respectively.",
    "data": {
      "deferred_revenue_additions_2025": 3600000000,
      "deferred_revenue_additions_2024": 783000000,
      "revenue_recognized_customer_advances_2025": 3700000000,
      "revenue_recognized_customer_advances_2024": 585000000,
      "revenue_recognized_in_fiscal_years_2025": 729000000,
      "revenue_recognized_in_fiscal_years_2024": 338000000,
      "revenue_remaining_obligations_gt1yr_total_2025": 1700000000,
      "revenue_remaining_obligations_gt1yr_deferred_revenue_2025": 1600000000,
      "revenue_remaining_obligations_gt1yr_not_billed_not_recognized_2025": 151000000,
      "percent_revenue_gt1yr_recognized_next_12m": 39,
      "foreign_currency_contracts_designated_accounting_hedges_notional_jan_26_2025": 1424,
      "foreign_currency_contracts_designated_accounting_hedges_notional_jan_28_2024": 1168,
      "foreign_currency_contracts_not_designated_accounting_hedges_notional_jan_26_2025": 1297,
      "foreign_currency_contracts_not_designated_accounting_hedges_notional_jan_28_2024": 597,
      "long_term_debt_net_carrying_amount_jan26_2025": 8463,
      "long_term_debt_net_carrying_amount_jan28_2024": 9709,
      "total_long_term_portion_jan26_2025": 8463,
      "total_long_term_portion_jan28_2024": 8459,
      "short_term_portion_of_debt_jan26_2025": -1250,
      "commercial_paper_program_amount": 575,
      "commercial_paper_outstanding_jan26_2025": 0,
      "inventory_purchase_obligations_jan26_2025": 30800000000,
      "other_non_inventory_purchase_obligations_jan26_2025": 14300000000,
      "other_non_inventory_purchase_obligations_cloud_services_jan26_2025": 10900000000,
      "purchase_commitments_2026": 35727,
      "purchase_commitments_2027": 3666,
      "purchase_commitments_2028": 2992,
      "purchase_commitments_2029": 2054,
      "purchase_commitments_2030": 422,
      "purchase_commitments_2031_and_beyond": 218,
      "total_future_purchase_commitments": 45079,
      "product_warranty_liabilities_jan26_2025": 1300000000,
      "product_warranty_liabilities_jan28_2024": 306000000,
      "product_warranty_liabilities_balance_end_of_period_jan26_2025": 1290,
      "product_warranty_liabilities_balance_end_of_period_jan28_2024": 306,
      "product_warranty_liabilities_balance_end_of_period_jan29_2023": 82,
      "product_warranty_liabilities_additions_jan26_2025": 1203,
      "product_warranty_liabilities_additions_jan28_2024": 278,
      "product_warranty_liabilities_additions_jan29_2023": 145,
      "product_warranty_liabilities_utilization_jan26_2025": -219,
      "product_warranty_liabilities_utilization_jan28_2024": -54,
      "product_warranty_liabilities_utilization_jan29_2023": -109
    },
    "chunk_id": 24
  },
  {
    "info": "Another putative derivative action was filed on October 30, 2023 in the Court of Chancery of the State of Delaware, captioned Horanic v. Huang, et al. (Case No. 2023-1096-KSJM). This lawsuit asserts claims, purportedly on behalf of us, against certain officers and directors of the Company for breach of fiduciary duty and insider trading based on the dissemination of allegedly false and misleading statements related to channel inventory and the impact of cryptocurrency mining on GPU demand. The plaintiffs seek unspecified damages and other relief, including disgorgement of profits from the sale of NVIDIA stock and reform of unspecified corporate governance measures. This derivative matter is stayed pending the final resolution of In Re NVIDIA Corporation Securities Litigation action. As of January 26, 2025, there are no accrued contingent liabilities associated with the legal proceedings described above based on our belief that liabilities, while reasonably possible, are not probable.",
    "data": {},
    "chunk_id": 25
  },
  {
    "info": "We recognized net interest and penalties related to unrecognized tax benefits in the income tax expense line of our consolidated statements of income of $92 million, $42 million, and $33 million during fiscal years 2025, 2024, and 2023, respectively.",
    "data": {
      "revenue_2025": 130497000000,
      "revenue_2024": 60922000000,
      "revenue_2023": 26974000000,
      "operating_income_2025": 81453000000,
      "operating_income_2024": 32972000000,
      "operating_income_2023": 4224000000,
      "dividends_2025": 834000000,
      "dividends_2024": 395000000,
      "dividends_2023": 398000000,
      "authorized_repurchase_2025": 38700000000,
      "share_repurchase_cash_2025": 34000000000,
      "share_repurchase_cash_2024": 9700000000,
      "repurchase_cash_for_jan27_2025_to_feb21_2025": 3700000000
    },
    "chunk_id": 26
  },
  {
    "info": "Between fiscal years 2026 and 2030, we expect to commence leases with future obligations of $7.6 billion primarily of data center and office operating leases, with lease terms of 3 to 15.5 years. Operating lease expenses for fiscal years 2025, 2024, and 2023 were $356 million, $269 million, and $193 million, respectively. As of January 26, 2025, our operating leases have a weighted average remaining lease term of 6.5 years and a weighted average discount rate of 4.16%. As of January 28, 2024, our operating leases had a weighted average remaining lease term of 6.1 years and a weighted average discount rate of 3.76%.",
    "data": {
      "future_lease_obligations_2026_2030": 7600000000,
      "operating_lease_expenses_2025": 356000000,
      "operating_lease_expenses_2024": 269000000,
      "operating_lease_expenses_2023": 193000000,
      "weighted_avg_remaining_lease_term_2025": 6.5,
      "weighted_avg_discount_rate_2025": 4.16,
      "weighted_avg_remaining_lease_term_2024": 6.1,
      "weighted_avg_discount_rate_2024": 3.76,
      "long_lived_assets_2025_total": 6283,
      "long_lived_assets_2025_us": 3626,
      "long_lived_assets_2025_taiwan": 1481,
      "long_lived_assets_2025_israel": 840,
      "long_lived_assets_2025_other": 336,
      "long_lived_assets_2024_total": 3914,
      "long_lived_assets_2024_us": 2595,
      "long_lived_assets_2024_taiwan": 773,
      "long_lived_assets_2024_israel": 325,
      "long_lived_assets_2024_other": 221,
      "present_value_net_future_minimum_lease_payments_2025": 1807,
      "total_operating_lease_obligations_2025": 2086,
      "less_imputed_interest_2025": 279,
      "short_term_operating_lease_liabilities_2025": 288,
      "long_term_operating_lease_liabilities_2025": 1519
    },
    "chunk_id": 27
  }
]